maximus-ms/esp32-uart_bridge/sdkconfig.defaults
# ESP32-C3 target
CONFIG_IDF_TARGET="esp32c3"

# Flash: 4 MB (required for two-OTA partition table)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# OTA: two app partitions
CONFIG_PARTITION_TABLE_TWO_OTA=y

# LWIP optimizations
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_SO_REUSE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Smaller binary
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Console via USB-Serial-JTAG (keeps UART pins clean for the bridge)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Task Watchdog: reboot if bridge tasks hang
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# HTTP server: increase buffer for OTA upload
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
